app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT "games".* FROM "games"

  def create
    # puts "Received parameters: #{params.inspect}"
    params[:game][:status] ||= 'will_play'
    @game = Game.new(game_params)

    if @game.save
---
INSERT INTO "games" ("title", "status", "hours_played", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "thren"], ["status", "played"], ["hours_played", 9.0], ["created_at", "2023-12-13 22:18:05.968542"], ["updated_at", "2023-12-13 22:18:05.968542"]]

  def update
    # @game = Game.find(params[:id])
    if @game.update(game_params)
---
UPDATE "games" SET "hours_played" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["hours_played", 9.0], ["updated_at", "2023-12-13 22:17:50.358444"], ["id", 10]]

  def destroy
    # @game = Game.find(params[:id])
    @game.destroy
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 2]]

  def delete_game
    @game = Game.find_by(id: params[:id])

    if @game
      @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 10]]

  def set_game
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]